app/views/groups/show.html.erb

	<h2><%= @group.name %> <%= @group.created_at %></h2>
	<% @group.tasks.each do |group_task| %>
---
SELECT "tasks".* FROM "tasks" INNER JOIN "groups_tasks" ON "tasks"."id" = "groups_tasks"."task_id" WHERE "groups_tasks"."group_id" = $1  [["group_id", 1]]