app/controllers/tasks_controller.rb

  def create
  	@task = current_user.tasks.new(task_params)
  	if @task.save
---
INSERT INTO "tasks" ("name", "hours", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "do anything"], ["hours", 1], ["author_id", 1], ["created_at", "2020-04-16 10:16:13.552298"], ["updated_at", "2020-04-16 10:16:13.552298"]]